Year is 2007
Product group is 6011
Product module is 8485
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
Starting sftp file transfer...
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/nielsen_extracts/RMS/2007/Movement_Files/6011_2007
sftp> lcd /tmp/tmp.vlMeGFCMLd
sftp> mget 8485_2007.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/nielsen_extracts/RMS/2007/Movement_Files/6011_2007/8485_2007.tsv to 8485_2007.tsv
8485_2007.tsv                                   0%    0     0.0KB/s   --:-- ETA8485_2007.tsv                                   7%   63MB  62.8MB/s   00:11 ETA8485_2007.tsv                                  19%  156MB  65.8MB/s   00:09 ETA8485_2007.tsv                                  28%  230MB  66.6MB/s   00:08 ETA8485_2007.tsv                                  42%  343MB  71.3MB/s   00:06 ETA8485_2007.tsv                                  57%  467MB  76.5MB/s   00:04 ETA8485_2007.tsv                                  73%  599MB  82.1MB/s   00:02 ETA8485_2007.tsv                                  81%  659MB  79.8MB/s   00:01 ETA8485_2007.tsv                                  89%  722MB  78.2MB/s   00:01 ETA8485_2007.tsv                                 100%  811MB  92.6MB/s   00:08    
sftp> bye
Contents of TMPDIR after sftp transfer:
total 811M
-rwxr-x--- 1 bsstng bsstng 811M Jun 20 14:17 8485_2007.tsv
Creating SQLite database and importing TSV file...
delete
exclusive
delete
Creating index on 'prmult'...
Adding 'mean_price' column...
Optimizing PRAGMA settings for bulk updates...
delete
exclusive
Starting batch updates...
Processing batch with offset 0...
Processing batch with offset 10000000...
Processing batch with offset 20000000...
Batch updates completed.
Calculating mean mean_price and total_sold...
Re-enabling normal settings...
delete
SQLite database size:
-rw-r----- 1 bsstng bsstng 1.4G Jun 20 14:18 /tmp/tmp.vlMeGFCMLd/tmp.db
Movement file processed.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a
sftp> ls
Master_Files_2006-2020
SCANNER_DATA_2009.tgz
SCANNER_DATA_2010.tgz
SCANNER_DATA_2011.tgz
SCANNER_DATA_2012.tgz
SCANNER_DATA_2013.tgz
SCANNER_DATA_2014.tgz
SCANNER_DATA_2015.tgz
SCANNER_DATA_2016.tgz
SCANNER_DATA_2017.tgz
SCANNER_DATA_2018.tgz
SCANNER_DATA_2019.tgz
SCANNER_DATA_2020.tgz
nielsen_extracts
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/Master_Files_2006-2020/Latest
sftp> lcd /tmp/tmp.vlMeGFCMLd
sftp> mget products.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/Master_Files_2006-2020/Latest/products.tsv to products.tsv
products.tsv                                    0%    0     0.0KB/s   --:-- ETAproducts.tsv                                   34%  310MB 310.0MB/s   00:01 ETAproducts.tsv                                   79%  711MB 319.1MB/s   00:00 ETAproducts.tsv                                  100%  890MB 365.2MB/s   00:02    
sftp> Contents of TMPDIR after sftp transfer:
total 3.7G
-rwxr-x--- 1 bsstng bsstng 811M Jun 20 14:17 8485_2007.tsv
-rwxr-x--- 1 bsstng bsstng 891M Jun 20 14:18 products.tsv
-rw-r----- 1 bsstng bsstng 1.4G Jun 20 14:18 tmp.db
Temp dir: /tmp/tmp.vlMeGFCMLd
Product module code: 8485
Product group code: 6011
Creating SQLite database and importing TSV file...
Data import completed.
SQLite database size:
-rw-r----- 1 bsstng bsstng 1.4G Jun 20 14:18 /tmp/tmp.vlMeGFCMLd/tmp.db
Script completed successfully.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner
sftp> put -r /tmp/tmp.vlMeGFCMLd/calculations
Uploading /tmp/tmp.vlMeGFCMLd/calculations/ to /Shared533--BARLEVIN/consumer_panel/kilts_scanner/calculations
Entering /tmp/tmp.vlMeGFCMLd/calculations/
Entering /tmp/tmp.vlMeGFCMLd/calculations/2007
Entering /tmp/tmp.vlMeGFCMLd/calculations/2007/6011
8485_2007.csv                                   0%    0     0.0KB/s   --:-- ETA8485_2007.csv                                 100%  104KB  32.2MB/s   00:00    
sftp> bye
Script completed successfully.
