Year is 2007
Product group is 2506
Product module is 3650
Starting sftp file transfer...
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/nielsen_extracts/RMS/2007/Movement_Files/2506_2007
sftp> lcd /tmp/tmp.ZgOxwSoeFj
sftp> mget 3650_2007.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/nielsen_extracts/RMS/2007/Movement_Files/2506_2007/3650_2007.tsv to 3650_2007.tsv
3650_2007.tsv                                   0%    0     0.0KB/s   --:-- ETA3650_2007.tsv                                 100%   46MB  78.1MB/s   00:00    
sftp> bye
Contents of TMPDIR after sftp transfer:
total 47M
-rwxr-x--- 1 bsstng bsstng 47M Jun 20 14:20 3650_2007.tsv
Creating SQLite database and importing TSV file...
delete
exclusive
delete
Creating index on 'prmult'...
Adding 'mean_price' column...
Optimizing PRAGMA settings for bulk updates...
delete
exclusive
Starting batch updates...
Processing batch with offset 0...
Batch updates completed.
Calculating mean mean_price and total_sold...
Re-enabling normal settings...
delete
SQLite database size:
-rw-r----- 1 bsstng bsstng 79M Jun 20 14:20 /tmp/tmp.ZgOxwSoeFj/tmp.db
Movement file processed.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
# Host myfiles.warwick.ac.uk found: line 9
# Host myfiles.warwick.ac.uk found: line 10
# Host myfiles.warwick.ac.uk found: line 11
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a
sftp> ls
Master_Files_2006-2020
SCANNER_DATA_2009.tgz
SCANNER_DATA_2010.tgz
SCANNER_DATA_2011.tgz
SCANNER_DATA_2012.tgz
SCANNER_DATA_2013.tgz
SCANNER_DATA_2014.tgz
SCANNER_DATA_2015.tgz
SCANNER_DATA_2016.tgz
SCANNER_DATA_2017.tgz
SCANNER_DATA_2018.tgz
SCANNER_DATA_2019.tgz
SCANNER_DATA_2020.tgz
nielsen_extracts
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/Master_Files_2006-2020/Latest
sftp> lcd /tmp/tmp.ZgOxwSoeFj
sftp> mget products.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/Master_Files_2006-2020/Latest/products.tsv to products.tsv
products.tsv                                    0%    0     0.0KB/s   --:-- ETAproducts.tsv                                   33%  298MB 297.8MB/s   00:01 ETAproducts.tsv                                   78%  694MB 307.7MB/s   00:00 ETAproducts.tsv                                  100%  890MB 357.1MB/s   00:02    
sftp> Contents of TMPDIR after sftp transfer:
total 1.1G
-rwxr-x--- 1 bsstng bsstng  47M Jun 20 14:20 3650_2007.tsv
-rwxr-x--- 1 bsstng bsstng 891M Jun 20 14:20 products.tsv
-rw-r----- 1 bsstng bsstng  79M Jun 20 14:20 tmp.db
Temp dir: /tmp/tmp.ZgOxwSoeFj
Product module code: 3650
Product group code: 2506
Creating SQLite database and importing TSV file...
Data import completed.
SQLite database size:
-rw-r----- 1 bsstng bsstng 79M Jun 20 14:20 /tmp/tmp.ZgOxwSoeFj/tmp.db
Script completed successfully.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
