Year is 2007
Product group is 6011
Product module is 8479
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
Starting sftp file transfer...
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/nielsen_extracts/RMS/2007/Movement_Files/6011_2007
sftp> lcd /tmp/tmp.Q9DOJkmptX
sftp> mget 8479_2007.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/nielsen_extracts/RMS/2007/Movement_Files/6011_2007/8479_2007.tsv to 8479_2007.tsv
8479_2007.tsv                                   0%    0     0.0KB/s   --:-- ETA8479_2007.tsv                                 100%   66MB 124.8MB/s   00:00    
sftp> bye
Contents of TMPDIR after sftp transfer:
total 66M
-rwxr-x--- 1 bsstng bsstng 66M Jun 20 14:18 8479_2007.tsv
Creating SQLite database and importing TSV file...
delete
exclusive
delete
Creating index on 'prmult'...
Adding 'mean_price' column...
Optimizing PRAGMA settings for bulk updates...
delete
exclusive
Starting batch updates...
Processing batch with offset 0...
Batch updates completed.
Calculating mean mean_price and total_sold...
Re-enabling normal settings...
delete
SQLite database size:
-rw-r----- 1 bsstng bsstng 113M Jun 20 14:18 /tmp/tmp.Q9DOJkmptX/tmp.db
Movement file processed.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a
sftp> ls
Master_Files_2006-2020
SCANNER_DATA_2009.tgz
SCANNER_DATA_2010.tgz
SCANNER_DATA_2011.tgz
SCANNER_DATA_2012.tgz
SCANNER_DATA_2013.tgz
SCANNER_DATA_2014.tgz
SCANNER_DATA_2015.tgz
SCANNER_DATA_2016.tgz
SCANNER_DATA_2017.tgz
SCANNER_DATA_2018.tgz
SCANNER_DATA_2019.tgz
SCANNER_DATA_2020.tgz
nielsen_extracts
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/Master_Files_2006-2020/Latest
sftp> lcd /tmp/tmp.Q9DOJkmptX
sftp> mget products.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/Master_Files_2006-2020/Latest/products.tsv to products.tsv
products.tsv                                    0%    0     0.0KB/s   --:-- ETAproducts.tsv                                   14%  132MB 132.5MB/s   00:05 ETAproducts.tsv                                   32%  287MB 134.6MB/s   00:04 ETAproducts.tsv                                   45%  407MB 133.2MB/s   00:03 ETAproducts.tsv                                   63%  567MB 135.9MB/s   00:02 ETAproducts.tsv                                   79%  707MB 136.3MB/s   00:01 ETAproducts.tsv                                   96%  859MB 137.8MB/s   00:00 ETAproducts.tsv                                  100%  890MB 140.4MB/s   00:06    
sftp> Contents of TMPDIR after sftp transfer:
total 1.1G
-rwxr-x--- 1 bsstng bsstng  66M Jun 20 14:18 8479_2007.tsv
-rwxr-x--- 1 bsstng bsstng 891M Jun 20 14:18 products.tsv
-rw-r----- 1 bsstng bsstng 113M Jun 20 14:18 tmp.db
Temp dir: /tmp/tmp.Q9DOJkmptX
Product module code: 8479
Product group code: 6011
Creating SQLite database and importing TSV file...
Data import completed.
SQLite database size:
-rw-r----- 1 bsstng bsstng 113M Jun 20 14:18 /tmp/tmp.Q9DOJkmptX/tmp.db
Script completed successfully.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner
sftp> put -r /tmp/tmp.Q9DOJkmptX/calculations
Uploading /tmp/tmp.Q9DOJkmptX/calculations/ to /Shared533--BARLEVIN/consumer_panel/kilts_scanner/calculations
Entering /tmp/tmp.Q9DOJkmptX/calculations/
Entering /tmp/tmp.Q9DOJkmptX/calculations/2007
Entering /tmp/tmp.Q9DOJkmptX/calculations/2007/6011
8479_2007.csv                                   0%    0     0.0KB/s   --:-- ETA8479_2007.csv                                 100% 3072     4.5MB/s   00:00    
sftp> bye
Script completed successfully.
