Year is 2007
Product group is 6011
Product module is 8473
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
Starting sftp file transfer...
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/nielsen_extracts/RMS/2007/Movement_Files/6011_2007
sftp> lcd /tmp/tmp.10ZP2wSE3b
sftp> mget 8473_2007.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/nielsen_extracts/RMS/2007/Movement_Files/6011_2007/8473_2007.tsv to 8473_2007.tsv
8473_2007.tsv                                   0%    0     0.0KB/s   --:-- ETA8473_2007.tsv                                   4%   63MB  62.8MB/s   00:20 ETA8473_2007.tsv                                  12%  166MB  66.8MB/s   00:17 ETA8473_2007.tsv                                  19%  258MB  69.3MB/s   00:15 ETA8473_2007.tsv                                  27%  367MB  73.3MB/s   00:13 ETA8473_2007.tsv                                  36%  491MB  78.3MB/s   00:10 ETA8473_2007.tsv                                  47%  635MB  84.9MB/s   00:08 ETA8473_2007.tsv                                  51%  691MB  82.0MB/s   00:07 ETA8473_2007.tsv                                  56%  758MB  80.5MB/s   00:07 ETA8473_2007.tsv                                  66%  894MB  86.1MB/s   00:05 ETA8473_2007.tsv                                  75% 1011MB  89.1MB/s   00:03 ETA8473_2007.tsv                                  83% 1122MB  91.4MB/s   00:02 ETA8473_2007.tsv                                  90% 1219MB  91.9MB/s   00:01 ETA8473_2007.tsv                                 100% 1346MB 104.5MB/s   00:12    
sftp> bye
Contents of TMPDIR after sftp transfer:
total 1.4G
-rwxr-x--- 1 bsstng bsstng 1.4G Jun 20 14:17 8473_2007.tsv
Creating SQLite database and importing TSV file...
delete
exclusive
delete
Creating index on 'prmult'...
Adding 'mean_price' column...
Optimizing PRAGMA settings for bulk updates...
delete
exclusive
Starting batch updates...
Processing batch with offset 0...
Processing batch with offset 10000000...
Processing batch with offset 20000000...
Processing batch with offset 30000000...
Batch updates completed.
Calculating mean mean_price and total_sold...
Re-enabling normal settings...
delete
SQLite database size:
-rw-r----- 1 bsstng bsstng 2.3G Jun 20 14:19 /tmp/tmp.10ZP2wSE3b/tmp.db
Movement file processed.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a
sftp> ls
Master_Files_2006-2020
SCANNER_DATA_2009.tgz
SCANNER_DATA_2010.tgz
SCANNER_DATA_2011.tgz
SCANNER_DATA_2012.tgz
SCANNER_DATA_2013.tgz
SCANNER_DATA_2014.tgz
SCANNER_DATA_2015.tgz
SCANNER_DATA_2016.tgz
SCANNER_DATA_2017.tgz
SCANNER_DATA_2018.tgz
SCANNER_DATA_2019.tgz
SCANNER_DATA_2020.tgz
nielsen_extracts
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/Master_Files_2006-2020/Latest
sftp> lcd /tmp/tmp.10ZP2wSE3b
sftp> mget products.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/Master_Files_2006-2020/Latest/products.tsv to products.tsv
products.tsv                                    0%    0     0.0KB/s   --:-- ETAproducts.tsv                                    7%   71MB  71.0MB/s   00:11 ETAproducts.tsv                                   24%  218MB  78.5MB/s   00:08 ETAproducts.tsv                                   41%  373MB  86.2MB/s   00:06 ETAproducts.tsv                                   58%  523MB  92.6MB/s   00:03 ETAproducts.tsv                                   85%  759MB 106.9MB/s   00:01 ETAproducts.tsv                                  100%  890MB 155.8MB/s   00:05    
sftp> Contents of TMPDIR after sftp transfer:
total 6.2G
-rwxr-x--- 1 bsstng bsstng 1.4G Jun 20 14:17 8473_2007.tsv
-rwxr-x--- 1 bsstng bsstng 891M Jun 20 14:19 products.tsv
-rw-r----- 1 bsstng bsstng 2.3G Jun 20 14:19 tmp.db
Temp dir: /tmp/tmp.10ZP2wSE3b
Product module code: 8473
Product group code: 6011
Creating SQLite database and importing TSV file...
Data import completed.
SQLite database size:
-rw-r----- 1 bsstng bsstng 2.3G Jun 20 14:19 /tmp/tmp.10ZP2wSE3b/tmp.db
Script completed successfully.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner
sftp> put -r /tmp/tmp.10ZP2wSE3b/calculations
Uploading /tmp/tmp.10ZP2wSE3b/calculations/ to /Shared533--BARLEVIN/consumer_panel/kilts_scanner/calculations
Entering /tmp/tmp.10ZP2wSE3b/calculations/
Entering /tmp/tmp.10ZP2wSE3b/calculations/2007
Entering /tmp/tmp.10ZP2wSE3b/calculations/2007/6011
8473_2007.csv                                   0%    0     0.0KB/s   --:-- ETA8473_2007.csv                                 100%   51KB  31.9MB/s   00:00    
sftp> bye
Script completed successfully.
