Year is 2007
Product group is 2506
Product module is 3627
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
Starting sftp file transfer...
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/nielsen_extracts/RMS/2007/Movement_Files/2506_2007
sftp> lcd /tmp/tmp.Q46nBu44FB
sftp> mget 3627_2007.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/nielsen_extracts/RMS/2007/Movement_Files/2506_2007/3627_2007.tsv to 3627_2007.tsv
3627_2007.tsv                                   0%    0     0.0KB/s   --:-- ETA3627_2007.tsv                                  30%   75MB  74.7MB/s   00:02 ETA3627_2007.tsv                                  55%  137MB  73.4MB/s   00:01 ETA3627_2007.tsv                                  90%  224MB  74.8MB/s   00:00 ETA3627_2007.tsv                                 100%  248MB  78.6MB/s   00:03    
sftp> bye
Contents of TMPDIR after sftp transfer:
total 248M
-rwxr-x--- 1 bsstng bsstng 248M Jun 20 14:19 3627_2007.tsv
Creating SQLite database and importing TSV file...
delete
exclusive
delete
Creating index on 'prmult'...
Adding 'mean_price' column...
Optimizing PRAGMA settings for bulk updates...
delete
exclusive
Starting batch updates...
Processing batch with offset 0...
Batch updates completed.
Calculating mean mean_price and total_sold...
Re-enabling normal settings...
delete
SQLite database size:
-rw-r----- 1 bsstng bsstng 428M Jun 20 14:19 /tmp/tmp.Q46nBu44FB/tmp.db
Movement file processed.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a
sftp> ls
Master_Files_2006-2020
SCANNER_DATA_2009.tgz
SCANNER_DATA_2010.tgz
SCANNER_DATA_2011.tgz
SCANNER_DATA_2012.tgz
SCANNER_DATA_2013.tgz
SCANNER_DATA_2014.tgz
SCANNER_DATA_2015.tgz
SCANNER_DATA_2016.tgz
SCANNER_DATA_2017.tgz
SCANNER_DATA_2018.tgz
SCANNER_DATA_2019.tgz
SCANNER_DATA_2020.tgz
nielsen_extracts
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/Master_Files_2006-2020/Latest
sftp> lcd /tmp/tmp.Q46nBu44FB
sftp> mget products.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/Master_Files_2006-2020/Latest/products.tsv to products.tsv
products.tsv                                    0%    0     0.0KB/s   --:-- ETAproducts.tsv                                   12%  111MB 110.6MB/s   00:07 ETAproducts.tsv                                   24%  215MB 109.9MB/s   00:06 ETAproducts.tsv                                   41%  371MB 114.5MB/s   00:04 ETAproducts.tsv                                   57%  513MB 117.3MB/s   00:03 ETAproducts.tsv                                   69%  622MB 116.5MB/s   00:02 ETAproducts.tsv                                   97%  872MB 129.8MB/s   00:00 ETAproducts.tsv                                  100%  890MB 146.9MB/s   00:06    
sftp> Contents of TMPDIR after sftp transfer:
total 1.7G
-rwxr-x--- 1 bsstng bsstng 248M Jun 20 14:19 3627_2007.tsv
-rwxr-x--- 1 bsstng bsstng 891M Jun 20 14:19 products.tsv
-rw-r----- 1 bsstng bsstng 428M Jun 20 14:19 tmp.db
Temp dir: /tmp/tmp.Q46nBu44FB
Product module code: 3627
Product group code: 2506
Creating SQLite database and importing TSV file...
Data import completed.
SQLite database size:
-rw-r----- 1 bsstng bsstng 428M Jun 20 14:20 /tmp/tmp.Q46nBu44FB/tmp.db
Script completed successfully.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner
sftp> put -r /tmp/tmp.Q46nBu44FB/calculations
Uploading /tmp/tmp.Q46nBu44FB/calculations/ to /Shared533--BARLEVIN/consumer_panel/kilts_scanner/calculations
Entering /tmp/tmp.Q46nBu44FB/calculations/
Entering /tmp/tmp.Q46nBu44FB/calculations/2007
Entering /tmp/tmp.Q46nBu44FB/calculations/2007/2506
3627_2007.csv                                   0%    0     0.0KB/s   --:-- ETA3627_2007.csv                                 100%   34KB  29.1MB/s   00:00    
sftp> bye
Script completed successfully.
