Year is 2007
Product group is 6011
Product module is 8777
Starting sftp file transfer...
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/nielsen_extracts/RMS/2007/Movement_Files/6011_2007
sftp> lcd /tmp/tmp.ov5ADUQZY1
sftp> mget 8777_2007.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/nielsen_extracts/RMS/2007/Movement_Files/6011_2007/8777_2007.tsv to 8777_2007.tsv
8777_2007.tsv                                   0%    0     0.0KB/s   --:-- ETA8777_2007.tsv                                  56%   31MB  30.9MB/s   00:00 ETA8777_2007.tsv                                 100%   55MB  35.6MB/s   00:01    
sftp> bye
Contents of TMPDIR after sftp transfer:
total 55M
-rwxr-x--- 1 bsstng bsstng 55M Jun 20 14:17 8777_2007.tsv
Creating SQLite database and importing TSV file...
delete
exclusive
delete
Creating index on 'prmult'...
Adding 'mean_price' column...
Optimizing PRAGMA settings for bulk updates...
delete
exclusive
Starting batch updates...
Processing batch with offset 0...
Batch updates completed.
Calculating mean mean_price and total_sold...
Re-enabling normal settings...
delete
SQLite database size:
-rw-r----- 1 bsstng bsstng 92M Jun 20 14:17 /tmp/tmp.ov5ADUQZY1/tmp.db
Movement file processed.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
# Host myfiles.warwick.ac.uk found: line 9
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a
sftp> ls
Master_Files_2006-2020
SCANNER_DATA_2009.tgz
SCANNER_DATA_2010.tgz
SCANNER_DATA_2011.tgz
SCANNER_DATA_2012.tgz
SCANNER_DATA_2013.tgz
SCANNER_DATA_2014.tgz
SCANNER_DATA_2015.tgz
SCANNER_DATA_2016.tgz
SCANNER_DATA_2017.tgz
SCANNER_DATA_2018.tgz
SCANNER_DATA_2019.tgz
SCANNER_DATA_2020.tgz
nielsen_extracts
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/Master_Files_2006-2020/Latest
sftp> lcd /tmp/tmp.ov5ADUQZY1
sftp> mget products.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/Master_Files_2006-2020/Latest/products.tsv to products.tsv
products.tsv                                    0%    0     0.0KB/s   --:-- ETAproducts.tsv                                    8%   79MB  79.2MB/s   00:10 ETAproducts.tsv                                   20%  180MB  81.3MB/s   00:08 ETAproducts.tsv                                   35%  319MB  87.1MB/s   00:06 ETAproducts.tsv                                   46%  415MB  88.0MB/s   00:05 ETAproducts.tsv                                   62%  556MB  93.3MB/s   00:03 ETAproducts.tsv                                   78%  703MB  98.7MB/s   00:01 ETAproducts.tsv                                   89%  796MB  98.1MB/s   00:00 ETAproducts.tsv                                  100%  890MB 113.2MB/s   00:07    
sftp> Contents of TMPDIR after sftp transfer:
total 1.1G
-rwxr-x--- 1 bsstng bsstng  55M Jun 20 14:17 8777_2007.tsv
-rwxr-x--- 1 bsstng bsstng 891M Jun 20 14:18 products.tsv
-rw-r----- 1 bsstng bsstng  92M Jun 20 14:17 tmp.db
Temp dir: /tmp/tmp.ov5ADUQZY1
Product module code: 8777
Product group code: 6011
Creating SQLite database and importing TSV file...
Data import completed.
SQLite database size:
-rw-r----- 1 bsstng bsstng 92M Jun 20 14:18 /tmp/tmp.ov5ADUQZY1/tmp.db
Script completed successfully.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner
sftp> put -r /tmp/tmp.ov5ADUQZY1/calculations
Uploading /tmp/tmp.ov5ADUQZY1/calculations/ to /Shared533--BARLEVIN/consumer_panel/kilts_scanner/calculations
Entering /tmp/tmp.ov5ADUQZY1/calculations/
Entering /tmp/tmp.ov5ADUQZY1/calculations/2007
Entering /tmp/tmp.ov5ADUQZY1/calculations/2007/6011
8777_2007.csv                                   0%    0     0.0KB/s   --:-- ETA8777_2007.csv                                 100% 4215     6.9MB/s   00:00    
sftp> bye
Script completed successfully.
