Year is 2007
Product group is 6011
Product module is 8529
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
Starting sftp file transfer...
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/nielsen_extracts/RMS/2007/Movement_Files/6011_2007
sftp> lcd /tmp/tmp.3J8kVk7ShQ
sftp> mget 8529_2007.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/nielsen_extracts/RMS/2007/Movement_Files/6011_2007/8529_2007.tsv to 8529_2007.tsv
8529_2007.tsv                                   0%    0     0.0KB/s   --:-- ETA8529_2007.tsv                                  44%   47MB  46.8MB/s   00:01 ETA8529_2007.tsv                                 100%  106MB  57.8MB/s   00:01    
sftp> bye
Contents of TMPDIR after sftp transfer:
total 106M
-rwxr-x--- 1 bsstng bsstng 106M Jun 20 14:17 8529_2007.tsv
Creating SQLite database and importing TSV file...
delete
exclusive
delete
Creating index on 'prmult'...
Adding 'mean_price' column...
Optimizing PRAGMA settings for bulk updates...
delete
exclusive
Starting batch updates...
Processing batch with offset 0...
Batch updates completed.
Calculating mean mean_price and total_sold...
Re-enabling normal settings...
delete
SQLite database size:
-rw-r----- 1 bsstng bsstng 182M Jun 20 14:17 /tmp/tmp.3J8kVk7ShQ/tmp.db
Movement file processed.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a
sftp> ls
Master_Files_2006-2020
SCANNER_DATA_2009.tgz
SCANNER_DATA_2010.tgz
SCANNER_DATA_2011.tgz
SCANNER_DATA_2012.tgz
SCANNER_DATA_2013.tgz
SCANNER_DATA_2014.tgz
SCANNER_DATA_2015.tgz
SCANNER_DATA_2016.tgz
SCANNER_DATA_2017.tgz
SCANNER_DATA_2018.tgz
SCANNER_DATA_2019.tgz
SCANNER_DATA_2020.tgz
nielsen_extracts
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Dat a/Master_Files_2006-2020/Latest
sftp> lcd /tmp/tmp.3J8kVk7ShQ
sftp> mget products.tsv
Fetching /Shared533--BARLEVIN/consumer_panel/kilts_scanner/2006-2020_Scanner_Data/Master_Files_2006-2020/Latest/products.tsv to products.tsv
products.tsv                                    0%    0     0.0KB/s   --:-- ETAproducts.tsv                                   23%  206MB 206.4MB/s   00:03 ETAproducts.tsv                                   42%  379MB 203.0MB/s   00:02 ETAproducts.tsv                                   70%  628MB 207.7MB/s   00:01 ETAproducts.tsv                                  100%  890MB 233.4MB/s   00:03    
sftp> Contents of TMPDIR after sftp transfer:
total 1.3G
-rwxr-x--- 1 bsstng bsstng 106M Jun 20 14:17 8529_2007.tsv
-rwxr-x--- 1 bsstng bsstng 891M Jun 20 14:18 products.tsv
-rw-r----- 1 bsstng bsstng 182M Jun 20 14:17 tmp.db
Temp dir: /tmp/tmp.3J8kVk7ShQ
Product module code: 8529
Product group code: 6011
Creating SQLite database and importing TSV file...
Data import completed.
SQLite database size:
-rw-r----- 1 bsstng bsstng 182M Jun 20 14:18 /tmp/tmp.3J8kVk7ShQ/tmp.db
Script completed successfully.
# Host myfiles.warwick.ac.uk found: line 6
# Host myfiles.warwick.ac.uk found: line 7
# Host myfiles.warwick.ac.uk found: line 8
/home/wbs/bsstng/.ssh/known_hosts updated.
Original contents retained as /home/wbs/bsstng/.ssh/known_hosts.old
spawn sftp u1774743@myfiles.warwick.ac.uk
u1774743@myfiles.warwick.ac.uk's password: 
Connected to myfiles.warwick.ac.uk.
sftp> cd /Shared533--BARLEVIN/consumer_panel/kilts_scanner
sftp> put -r /tmp/tmp.3J8kVk7ShQ/calculations
Uploading /tmp/tmp.3J8kVk7ShQ/calculations/ to /Shared533--BARLEVIN/consumer_panel/kilts_scanner/calculations
Entering /tmp/tmp.3J8kVk7ShQ/calculations/
Entering /tmp/tmp.3J8kVk7ShQ/calculations/2007
Entering /tmp/tmp.3J8kVk7ShQ/calculations/2007/6011
8529_2007.csv                                   0%    0     0.0KB/s   --:-- ETA8529_2007.csv                                 100%   14KB  12.2MB/s   00:00    
sftp> bye
Script completed successfully.
